In [1]:
import pandas as pd

In [5]:
file = 'https://raw.githubusercontent.com/alyanien/DATASAINS/main/toyota.csv'
dataset = pd.read_csv(file, sep=',')
dataset.head()

   model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0   GT86  2016  16000       Manual    24089   Petrol  265  36.2         2.0
1   GT86  2017  15995       Manual    18615   Petrol  145  36.2         2.0
2   GT86  2015  13998       Manual    27469   Petrol  265  36.2         2.0
3   GT86  2017  18998       Manual    14736   Petrol  150  36.2         2.0
4   GT86  2017  17498       Manual    36284   Petrol  145  36.2         2.0

In [6]:
#MEMPERLIHATKAN KOLOM MODEL, PRICE, DAN TRANSMISSION

In [8]:
data_1 = dataset[['model','price', 'transmission',]]
data_1.head()

   model  price transmission
0   GT86  16000       Manual
1   GT86  15995       Manual
2   GT86  13998       Manual
3   GT86  18998       Manual
4   GT86  17498       Manual

In [9]:
#MENAMPILKAN HANYA TRANSMISSION AUTOMATIC

In [31]:
df_automatic = data_1[data_1['transmission'] == 'Automatic']
df_automatic.head()

    model  price transmission
18   GT86  23495    Automatic
31   GT86  27060    Automatic
58   GT86  11599    Automatic
66   GT86   9995    Automatic
67   GT86  10499    Automatic

In [30]:
#MENAMPILKAN HANYA MODEL COROLLA DENGAN TRANSMISSION AUTOMATIC

In [60]:
df_model = data_1[(data_1.transmission == "Automatic") & (data_1.model == " Corolla")]
df_model.head()

       model  price transmission
73   Corolla  22500    Automatic
75   Corolla  20250    Automatic
76   Corolla  26980    Automatic
77   Corolla  21995    Automatic
79   Corolla  22498    Automatic

In [62]:
#MENCARI RATA RATA HARGA MOBIL COROLLA YANG AUTOMATIC

In [63]:
df_model['price'].mean()

22924.416216216217

In [64]:
df_model['price'].max()

29450

In [65]:
df_model['price'].min()

899

In [66]:
#MENCARI TAU MOBIL COROLLA MANA DENGAN HARGA MAX

In [70]:
df_max = dataset[(dataset.transmission == "Automatic") & (dataset.model == " Corolla")& (dataset.price == 29450)]
df_max.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
239,Corolla,2020,29450,Automatic,943,Hybrid,135,53.3,2.0

In [71]:
#MENCARI TAU MOBIL COROLLA MANA DENGAN HARGA MIN

In [72]:
df_min = dataset[(dataset.transmission == "Automatic") & (dataset.model == " Corolla")& (dataset.price == 899)]
df_min.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
289,Corolla,2001,899,Automatic,76000,Petrol,300,35.3,1.6